#include "menu.h"
#include<stdio.h>
static int select()
{
        int op;//选择
        printf("\033[3m\033[1m 请选择功能>>\033[32m");//斜体加粗
        scanf_s("%d", &op); 
        getchar();
        fflush(stdin);
        printf("\033[0m");
        return op;
}
int welcomemenu()
{
    
    printf("\t\t\033[01m\033[38;2;180;255;245m *****欢迎使用图书管理系统******\n");//粗体模式，自定义颜色
    printf("\t\t\033[01m\033[38;2;180;255;245m *       1. 登录系统           *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m *       2. 退出系统           *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m *******************************\033[0m\n");
   
    return select();
}
int mainmenu()
{
   
    printf("\t\t\033[38;2;180;255;245m   **********************************\n");
    printf("\t\t\033[38;2;180;255;245m   *       1.用户管理               * \n");             
    printf("\t\t\033[38;2;180;255;245m   *       2.读者管理               *\n");            
    printf("\t\t\033[38;2;180;255;245m   *       3.图书管理和图书信息查询 *\n");            
    printf("\t\t\033[38;2;180;255;245m   *       4.图书流通管理           *\n");        
    printf("\t\t\033[38;2;180;255;245m   *       5.退出系统               *\n");            
    printf("\t\t\033[38;2;180;255;245m   **********************************\n\033[0m");
  
    return select();
}

int usermenu()
{

    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        1.用户信息输入       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        2.用户类型修改       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        3.用户信息删除       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        4.用户信息显示       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        5.用户密码修改       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        6.返回主菜单         *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\n\033[0m");
    return select();
}

int readermenu()
{
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        1.读者信息输入       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        2.读者信息修改       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        3.读者信息删除       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        4.读者信息查询       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        5.读者信息显示       *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*        6.返回主菜单         *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\033[0m\n");
    return select();
}

int bookmenu()
{
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   1.图书信息输入            *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   2.图书信息修改            *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   3.图书信息查询            *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   4.统计汇总                *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   5.返回主菜单              *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\033[0m\n");
    return select();
}
//如果在图书管理菜单中选择3.图书信息查询，就进入这个子菜单
int booksearchmenu()
{
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   1.按书号查询              *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   2.按书名查询              *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   3.按作者查询              *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   4.按出版社查询            *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   5.返回上级菜单            *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\033[0m\n");
    return select();
}

int bookcirculatemenu()
{
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   1.借书处理                 *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   2.还书处理                 *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*   3.返回主菜单               *\n");
    printf("\t\t\033[01m\033[38;2;180;255;245m*******************************\033[0m\n");
    return select();
}

